const hotelStar = [
  'انتخاب کنید',
  '  سه‌ستاره   ',
  ' چهار‌ستاره ',
  ' پنج‌ستاره'

]

const hotelProperty = [
  '    سالن سینمایی ',
  '  کافی‌نت و گیم‌نت',
  ' اینترنت ',
  ' فیلم  ',
  'نورگیر',
  'استخر',
  'سونا ',
  'جکوزی',
  'باشگاه',
  'فروشگاه ',
  'سرویس‌بهداشتی فرنگی',
  '  پارک کودک  ',
  'سیستم سرمایشی',
  'قنادی',
  'سیستم گرمایشی',
  'پریز برق',
  'تهویه مطبوع',
  'سیستم صوتی',
  'سرویس‌بهداشتی ایرانی',
  'عایق صدا ',
  'رستوران',
  'کافه',
  'آتلیه عکاسی',
  'صرافی'

]
export {
  hotelStar,
  hotelProperty
}
