import * as yup from 'yup'
export const schema = yup.object().shape({

  birthDate: yup
    .string()
    .matches(
      /^(?=.*\d)(?=.*[!@#$%^&*])(?=.*[a-z])(?=.*[A-Z]).{8,16}$/,
      ' پسوورد باید شامل یک حرف بزرگ ,یک حرف کوچک ,یک شماره و شامل کاراکتر های  (!@#$%^&*) باشد '
    )
    .required('  لطفا این فیلد را پر کنید'),
  fullName: yup
    .string()
    // .required('  لطفا این فیلد را پر کنید')
    .max(13, 'بیشترین طول ممکن برای نام کاربری 13 است')
    .min(2, 'کمترین طول ممکن برای نام کاربری 3 است')

})
